curamaj/DSPICAutonomousMobileRobot/robocar.c
#include <xc.h>
#include "./robocar.h"

// I have no clue where this pragma magic is defined.
// All these are got as bits and pieces from other code bases on interne.
// Pls do not delete any of these !!!

#pragma config BWRP = WRPROTECT_OFF     // Boot Segment Write Protect (Boot Segment may be written)
#pragma config BSS = NO_FLASH           // Boot Segment Program Flash Code Protection (No Boot program Flash segment)
#pragma config RBS = NO_RAM             // Boot Segment RAM Protection (No Boot RAM)

// FSS
#pragma config SWRP = WRPROTECT_OFF     // Secure Segment Program Write Protect (Secure segment may be written)
#pragma config SSS = NO_FLASH           // Secure Segment Program Flash Code Protection (No Secure Segment)
#pragma config RSS = NO_RAM             // Secure Segment Data RAM Protection (No Secure RAM)

// FGS
#pragma config GWRP = OFF               // General Code Segment Write Protect (User program memory is not write-protected)
#pragma config GSS = OFF                // General Segment Code Protection (User program memory is not code-protected)

// FOSCSEL
#pragma config FNOSC = FRCPLL           // Oscillator Mode (Internal Fast RC (FRC) w/ PLL)
#pragma config IESO = ON                // Internal External Switch Over Mode (Start-up device with FRC, then automatically switch to user-selected oscillator source when ready)

// FOSC
#pragma config POSCMD = NONE            // Primary Oscillator Source (Primary Oscillator Disabled)
#pragma config OSCIOFNC = OFF           // OSC2 Pin Function (OSC2 pin has clock out function)
#pragma config IOL1WAY = ON             // Peripheral Pin Select Configuration (Allow Only One Re-configuration)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor (Both Clock Switching and Fail-Safe Clock Monitor are disabled)

// FWDT
#pragma config WDTPOST = PS32768        // Watchdog Timer Postscaler (1:32,768)
#pragma config WDTPRE = PR128           // WDT Prescaler (1:128)
#pragma config WINDIS = OFF             // Watchdog Timer Window (Watchdog Timer in Non-Window mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (Watchdog timer enabled/disabled by user software)

// FPOR
#pragma config FPWRT = PWR128           // POR Timer Value (128ms)
#pragma config ALTI2C = OFF             // Alternate I2C  pins (I2C mapped to SDA1/SCL1 pins)
#pragma config LPOL = ON                // Motor Control PWM Low Side Polarity bit (PWM module low side output pins have active-high output polarity)
#pragma config HPOL = ON                // Motor Control PWM High Side Polarity bit (PWM module high side output pins have active-high output polarity)
#pragma config PWMPIN = ON              // Motor Control PWM Module Pin Mode bit (PWM module pins controlled by PORT register at device Reset)

// FICD
#pragma config ICS = PGD1               // Comm Channel Select (Communicate on PGC1/EMUC1 and PGD1/EMUD1)
#pragma config JTAGEN = OFF             // JTAG Port Enable (JTAG is Disabled)

#define PPSUnLock __builtin_write_OSCCONL(OSCCON & 0xBF)
#define PPSLock __builtin_write_OSCCONL(OSCCON | 0x40)

void crk_bzero(char *s, int n)
{
	int i;
	for (i=0; i < n; i++) *s++ = 0;
}

//Generic SPI interface
unsigned char SPI_Transmit(unsigned char TxValue)
{
    while (SPI1STATbits.SPITBF == 1)
			;// wait until TX buffer is empty due to a prior process
    SPI1BUF = TxValue; // when empty, send the byte to the tx buffer
    while (SPI1STATbits.SPIRBF == 0)
			;//As valid bits shifts out of SDO, junk bits are recieved from SDI,			 // wait till the RX buffer is full of junk data
    return SPI1BUF; //when full, read the junk data in RX buffer from SPI1BUF
}

unsigned char SPI_Receive()
{
    printf( "CRK-DEBUG SPI STAT Bits = (%x) \n",SPI1STATbits.SPITBF);
    while (SPI1STATbits.SPITBF == 1)
			;// wait until TX buffer is empty due to a prior process
    SPI1BUF = 0x00; // when empty, send the junk byte (0x00) to the TC buffer.
    while (SPI1STATbits.SPIRBF == 0)
			; // As junk bits shifts out of SDO, vald bits are recieved from SDI
			  // wait till the RX buffer is full of valid data
    return SPI1BUF; // when full, read the valid data in RX buffer from SPI1BUF
}

void Write_Status_Reg(unsigned char WriteStatusByte)
{
    LATBbits.LATB6 = 0;
    SPI_Transmit(0x01);
    SPI_Transmit(WriteStatusByte);
    LATBbits.LATB6 = 1;
}

unsigned char Read_Status_Reg()
{
    LATBbits.LATB6 = 0;
    SPI_Transmit(0x05);
    unsigned char status = SPI_Receive();
    LATBbits.LATB6 = 1;
    return status;
}

//Sram specific SPI interface
void Write_Byte_Sram(unsigned int Address, unsigned char SentByte)
{
    LATBbits.LATB6 = 0;
    SPI_Transmit (0x02);
    SPI_Transmit((Address >> 8)& 0xFF);
    SPI_Transmit (Address & 0xFF);
    SPI_Transmit (SentByte);
    LATBbits.LATB6 = 1;
}

unsigned char Read_Byte_Sram(unsigned int Address)
{
    LATBbits.LATB6 = 0;
    SPI_Transmit (0x03);
    SPI_Transmit((Address >> 8)& 0xFF);
    SPI_Transmit (Address & 0xFF);
    unsigned char RecievedByte = SPI_Receive();
    LATBbits.LATB6 = 1;
    return RecievedByte;
}
//Flash Interface follows

unsigned char Write_Byte_Flash(unsigned char cmd, 
				long int address, unsigned char SendByte)
{
	LATBbits.LATB6 = 0;
	SPI_Transmit(cmd);
	SPI_Transmit((address >> 16)&0xFF);
	SPI_Transmit((address >> 8)&0xFF);
	SPI_Transmit(address & 0xFF);
    SPI_Transmit(SendByte);
	unsigned char junk = SPI_Receive();
    LATBbits.LATB6 = 1;
	return(junk);
}

unsigned char Read_Byte_Flash(unsigned char cmd, long int address)
{
	LATBbits.LATB6 = 0;
	SPI_Transmit(cmd);
	SPI_Transmit((address >> 16)&0xFF);
	SPI_Transmit((address >> 8)&0xFF);
	SPI_Transmit(address & 0xFF);
	unsigned char ReceivedByte = SPI_Receive();
    LATBbits.LATB6 = 1;
	return(ReceivedByte);
}

void WREN()
{
	LATBbits.LATB6 = 0; // Lower SS for instruction delivery
	SPI_Transmit(0x06); // Send WREN
	LATBbits.LATB6 = 1; // Raise SS for instruction completiomn
}

void BulkErase()
{
	LATBbits.LATB6 = 0; // Lower SS for instruction delivery
	SPI_Transmit(0xC7); // Send Bulk Erase 
	LATBbits.LATB6 = 1; // Raise SS for instruction completiomn
}

unsigned char WriteStatusReg(unsigned char SendByte)
{
	LATBbits.LATB6 = 0;
	SPI_Transmit(0x01);
    SPI_Transmit(SendByte);
	unsigned char junk = SPI_Receive();
    LATBbits.LATB6 = 1;
	return(junk);
}
unsigned char ReadStatusReg()
{
	LATBbits.LATB6 = 0; 
	SPI_Transmit(0x05); // Send Read Status register instruction
	unsigned char status = SPI_Receive();
	LATBbits.LATB6 = 1;
	return(status);
}	
//These delay functions needs tuning, once I freee on CPU frequency
void delay(int lim1, int lim2)
{
	int i, j;
	int k;
	for(i=0; i < lim1; i++)
		for (j = 0; j < lim2; j++)
			k = 23;	
}

