curamaj/DSPICAutonomousMobileRobot/robocar.c
void DelayInSeconds(int seconds)
{
	int i;
    
    for(i=0; i < seconds; i++) {
        delay(500, 10); //One second approx delay
    }
}
void delay_ms(int n)
{
	int i,j, k;
	for (i=0; i < n; i++)
		for(j=0; j < 10; j++)
			k = i+j;

}
void LEDInit()
{
    //IO Definiton
    AD1PCFGL = 0xFFFF; //Pins RA0 and RA1 are assigned to analog pins
    TRISAbits.TRISA0 = 1;// Pin in RA0 assigned input
    TRISAbits.TRISA1 = 0; // Pin in RA1 assigned as Output
}

void LEDOn(int time)
{
	int i;
	int count = time * 1;
	for (i=0; i < count; i++) {
        if (PORTAbits.RA0 == 1){
            LATAbits.LATA1 = 1;
        } else {
            LATAbits.LATA1 = 0;
        }
    }        
}

void LEDBlink(int count)
{
	int i;

	for(i=0; i < count; i++) {
		if(PORTAbits.RA0 == 1) {
			LATAbits.LATA1 = 0;
            DelayInSeconds(2);
			LATAbits.LATA1 = 1;
			DelayInSeconds(3);
		} else {
			LATAbits.LATA1 = 0;
		}
	}
}

void LEDOff()
{
    if (PORTAbits.RA0 == 1) {
            LATAbits.LATA1 = 0;
        }
}
void LEDTest(void)
{
	printf("CRK-DEBUG Testing LED\n");
	LEDBlink(2);
	LEDOff();
}


//* PWM1 H1 controls channel CH1 
void TurnLeft(void)
{
	int n, i;

	rc_angle = GetFloatArg();
	n = rc_angle/rc_angle_per_pulse;

	printf("\n\r CRK-DEBUG rc_angle = (%f) no of pulses = (%d)", rc_angle, n);
  	printf("CRK-DEBUG Servo test Left P1TPER = (%d) P1DC1 = (%d) \n", P1TPER, P1DC1);
	for(i=0; i < n; i++) {
		P1DC1 = rc_left; 
		P1TCONbits.PTEN = 1;
	}
}

void Middle(void)
{
	rc_angle = 0.0;
	printf("\n\rCRK-DEBUG rc_angle = (%f)", rc_angle);
	printf("CRK-DEBUG Servo test Middle P1TPER = (%d) P1DC1 = (%d) \n", P1TPER, P1DC1);
		P1DC1 = rc_middle; 
		P1TCONbits.PTEN = 1;
}

void TurnRight(void)
{
	int n, i;

	rc_angle = GetFloatArg();
	n = rc_angle/rc_angle_per_pulse;

	printf("\n\r CRK-DEBUG rc_angle = (%f) no of pulses = (%d)", rc_angle, n);
	printf("CRK-DEBUG Servo test Right P1TPER = (%d) P1DC1 = (%d) \n", P1TPER, P1DC1);
	for (i=0; i < n; i++) {
		P1DC1 = rc_right; 
		P1TCONbits.PTEN = 1;
	}
}

void MoveFwd(void)
{
	int n, i;

	rc_travel_distance = GetFloatArg();
	n = rc_travel_distance/rc_one_fwd_pulse_distance;
	
	printf("\n\rCRK-DEBUG distance = (%f) no of pulses = (%d)", rc_travel_distance, n);
	printf("CRK-DEBUG Servo test FWD !!! P2TPER = (%d) P2DC1 = (%d) rc_fwd = (%d) \n", P2TPER, P2DC1, rc_fwd);
	for(i=0; i < n; i++) {
		P2DC1 = rc_fwd; 
		P2TCONbits.PTEN = 1;
	}
}


void MoveBack(void)
{
	int n, i;

	n = rc_travel_distance/rc_one_bkwd_pulse_distance;
	rc_travel_distance = GetFloatArg();
	printf("\n\rCRK-DEBUG distance = (%f) no of pulses = (%d)", rc_travel_distance, n);
	printf("SCRK-DEBUG ervo test Back !!! P2TPER = (%d) P2DC1 = (%d) rc_back = (%d) \n", P2TPER, P2DC1, rc_back);

	for(i=0; i < n; i++) {
		P2DC1 = rc_back; 
		P2TCONbits.PTEN = 1;
	}
}


void Stop(void)
{
		P2DC1 = rc_still; 
		P2TCONbits.PTEN = 1;
printf("Servo test Stop !!! P2TPER = (%d) P2DC1 = (%d) stop = (%d) \n", P2TPER, P2DC1,rc_still);
}

void ServoInit(void)
{

	rc_full_cycle =  FREQ62_5HZ; // Use this to get 62.5 Hz 

	P1TCONbits.PTEN = 0; // DO not enable clock deliverto PWM1 timer yet
	P1TCONbits.PTCKPS = 3; // Prescale is 1:1, Timer clock = FP ( 57.6 KHz ??)
	P1TCONbits.PTMOD = 0; // PWM1 is free running mode

	//PWM1 counter and period definitions
	P1TMRbits.PTMR = 0; // Initial value in PWM1 counter

	P1TPER = rc_full_cycle; //PWM1 perios register produces 20 msec PWM period
	
	//PWM1 control register
	PWM1CON1bits.PMOD3 = 1; //PWM1H3 and PWM1L3 outouts are independent
	PWM1CON1bits.PMOD2 = 1; //PWM1H2 and PWM1L2 outouts are independent
	PWM1CON1bits.PMOD1 = 1; //PWM1H1 and PWM1L1 outouts are independent

	PWM1CON1bits.PEN3H = 0; //PWM1H3 is disabled
	PWM1CON1bits.PEN2H = 0; //PWM1H3 is disabled
	PWM1CON1bits.PEN1H = 1; //PWM1H1 is enabled
	PWM1CON1bits.PEN3L = 0; //PWM1L3 is disabled
	PWM1CON1bits.PEN2L = 0; //PWM1L2 is disabled
	PWM1CON1bits.PEN1L = 0; //PWM1L1 is disabled

	// PWM control 2 registers
	PWM1CON2bits.IUE = 0; //Updates are synchronized with timnebase
	PWM1CON2bits.UDIS = 0; // Updates from perios and suty cycle registers are enabled

	// Duty cycle for PWM CH1 Forward, backword, still
	rc_left = 2 *11.3 * rc_full_cycle / 100;
	rc_right = 2 *6.6 * rc_full_cycle / 100;
	rc_middle = 2 *9.0 * rc_full_cycle / 100;

	// Channel CH2 which controls FWD, Backword and Still is on PWM2H (Pin 23)
	P2TCONbits.PTEN = 0; // DO not enable clock deliverto PWM1 timer yet
	P2TCONbits.PTCKPS = 3; // Prescale is 1:1, Timer clock = FP ( 57.6 KHz ??)
	P2TCONbits.PTMOD = 0; // PWM1 is free running mode

	//PWM1 counter and period definitions
	P2TMRbits.PTMR = 0; // Initial value in PWM1 counter

	P2TPER = rc_full_cycle; //PWM1 perios register produces 20 msec PWM period
	
	//PWM1 control register
	PWM2CON1bits.PMOD1 = 1; //PWM1H1 and PWM1L1 outouts are independent

	PWM2CON1bits.PEN1H = 1; //PWM1H1 is enabled
	PWM2CON1bits.PEN1L = 0; //PWM1L1 is disabled

	// PWM control 2 registers
	PWM2CON2bits.IUE = 0; //Updates are synchronized with timnebase
	PWM2CON2bits.UDIS = 0; // Updates from perios and suty cycle registers are enabled
//We need to fine tune these !!!
	rc_fwd = 2 * 10.0 * rc_full_cycle / 100;
	rc_still = 2 *  9.4 * rc_full_cycle / 100;
	rc_back = 2 * 8.8 * rc_full_cycle / 100;	

}

unsigned char U1Rx(void)
{
	char ch;
	int i =0;
	char data[128];

	U1STAbits.OERR = 0;
	U1STAbits.FERR == 0;

	while(i < 128) {
		/* Check for receive errors */
		i++;
		if(U1STAbits.FERR == 1) {
			continue;
		}
		/* Must clear the overrun error to keep UART receiving */
		if(U1STAbits.OERR == 1) {
			U1STAbits.OERR = 0;
			continue;
		}
		/* Get the data */
		if(U1STAbits.URXDA == 1) {
			ch = U1RXREG;
			data[i-1] = ch;
		}
	}
printf("In U1Rx Received data = (%s)= \n", data);
	return (ch);
}

void U1Tx(unsigned char ch)

{
   	while (U1STAbits.TRMT  == 0)
		; // Wait till the transmit buffer is empty
	U1TXREG  = ch;
}

unsigned char U2Rx(void)
{
	unsigned char ch;
	while(U2STAbits.URXDA != 1) 
			;
	ch = U2RXREG;
	return(ch);
}
void U2Tx(unsigned char ch)

{
   	while (U2STAbits.TRMT  == 0)
		; // Wait till the transmit buffer is empty
	U2TXREG  = ch;
}

void BlueToothTest(void)
{
	int i;

