curamaj/DSPICAutonomousMobileRobot/robocar.c
	char *buf = "Hello World\n Enter character ";
	printf("CRK-DEBUG BlueTooth Test !!!\n");
	for (i=0; i < strlen(buf); i++) {
		U2Tx(buf[i]);
	}
}
		

boolean	TraceAndLogGPSRecord(nmea_rec *gps_rec)
{
	int i = 0;
	char buf[MAXLINELENGTH*2];
	int n = MAXLINELENGTH * 2;
	int overrunerror = 0;
	int rxerror = 0;
	int j = 0;

	crk_bzero(buf, n);
    printfBT("\n\rCRK-DEBUG Tracing and collecting GPS record \n");
	U1STAbits.URXISEL = 0;
	U1STAbits.FERR = 0;
	U1STAbits.OERR = 0;
	j = 0;
	while (i < n) { // No of tries is 256
		/* Check for receive errors */
		if(U1STAbits.FERR == 1) {
    		printf("CRK-DEBUG Testing GPS Error !!! i = (%d) \n", i++);
			rxerror++;
			U1STAbits.FERR = 0;
			continue;
		}
		/* Must clear the overrun error to keep UART receiving */
		if(U1STAbits.OERR == 1) {
			U1STAbits.OERR = 0;
			overrunerror++;
    		printf("CRK-DEBUG Testing GPS Error Overrun !!! i = (%d) \n", i++);
			continue;
		}
		/* Get the data */
		if(U1STAbits.URXDA == 1) {
			buf[j++]  = U1RXREG;
		}
	}

	if (rxerror || overrunerror) {
  		printfBT("\n\rCRK-DEBUG Testing ... GPS Error !!!");
		crk_bzero(btbuf, BTBUF); sprintf(btbuf, "\n\rCRK-DEBUG GPS Testing error rxerror = (%d) overrunerror = (%d)", rxerror, overrunerror);printfBT(btbuf);
		return false;
	}

	printf("\n\rCRK-DEBUG Buffer = (%s)\n", buf);
	printfBT(buf);
	return (GetGPRMCorGPGGA(buf, gps_rec));
}

void ServoTest()

{

	int i = 0;

	printf("CRK-DEBUG Starting test in 5 secs !!!");
	DelayInSeconds(5);

	// CH1 controls steering
	for(i=0; i <10; i++) {
		printf("CRK-DEBUG Turn Left\n");
		TurnLeft();
		DelayInSeconds(50);
		printf("CRK-DEBUG Come to  Middle\n");
		Middle();
		DelayInSeconds(50);
		printf("CRK-DEBUG Turn Right\n");
		TurnRight();
		DelayInSeconds(50);

		// CH2 Test
		printf("CRK-DEBUG Move 1 Backword\n");
		MoveBack();
		DelayInSeconds(50);
		printf("CRK-DEBUG Move 2 Backword\n");
		MoveBack();
		DelayInSeconds(50);
		printf("CRK-DEBUG Stop\n");
		Stop();
		DelayInSeconds(50);
		printf("CRK-DEBUG Move 1 Forward\n");
		MoveFwd();
		DelayInSeconds(50);
		printf("CRK-DEBUG Move 2 Forward\n");
		MoveFwd();
		DelayInSeconds(50);
	}
}

void SPITestSram(void)
{
    //more code for application goes here.
	unsigned char c;
    Write_Status_Reg(0x1);
   
    while((Read_Status_Reg() & 0xC1) == 0x03)
     Read_Status_Reg();
    Write_Byte_Sram(0x0000,20);//
   
    c = Read_Byte_Sram (0x0000);
	printf("CRK-DEBUG CRK-DEBUG Should read back 20 %d \n", c);
}

void SPITestFlash(void)
{
	unsigned char c;
	int i;

	printf("CRK-DEBUG Testing SPI flash now \n");
	WREN();
	printf("CRK-DEBUG Status2 Reg1 = (%x)\n", ReadStatusReg());
    WriteStatusReg(0x0);
	WREN();
	BulkErase();

	printf("CRK-DEBUG Status4 Reg2 = (%x)\n", ReadStatusReg());
    DelayInSeconds(10);
	printf("CRK-DEBUG Status5 Reg21 = (%x)\n", ReadStatusReg());
	WREN();
    DelayInSeconds(10);
	printf("CRK-DEBUG Status5 Reg22 = (%x)\n", ReadStatusReg());
	c= Write_Byte_Flash(0x02, 0x020000, 45); // When WEL = 1 perform write

	printf("CRK-DEBUG Status6 Reg3 = (%x)\n", ReadStatusReg());
    DelayInSeconds(1);
	c = Read_Byte_Flash(0x03,0x020000); // When WIP = 0 read byte back
	printf("CRK-DEBUG Status7 Reg4 = (%x)\n", ReadStatusReg());
    
	printf("CRK-DEBUG Hello World This is what I read from flash (%d)\n", c);
	printf("CRK-DEBUG Looping now\n");
	for ( i = 0; i < 255; i++) {
		WREN();
		c= Write_Byte_Flash(0x02, 0x020000+i, i); // When WEL = 1 perform write
    	DelayInSeconds(1);
		c= Read_Byte_Flash(0x03, 0x020000+i); // When WEL = 1 perform write
		printf("CRK-DEBUG %d. Hello World This is what I read from flash (%d)\n", i, c);
	}
}

//TBD
void SPITestMagnet(void)
{
    unsigned char status;

	printf("CRK-DEBUG Now dping SPI Test !!!\n");
	while (1) {
		status = SPI_Receive();
		printf("CRK-DEBUG SPI receceive = (%c)\n", status);
		DelayInSeconds(1);
	}
	
}

void SPIInit()
{
	//SPI channel setting.
    SPI1CON1bits.DISSCK = 0;
    SPI1CON1bits.DISSDO = 0;        
    SPI1CON1bits.MODE16 = 0;
    SPI1CON1bits.SSEN = 0;
    SPI1CON1bits.MSTEN = 1;
    SPI1CON1bits.SMP = 0;
    SPI1CON1bits.CKE = 1;
    SPI1CON1bits.CKP = 0;
    SPI1CON1bits.PPRE = 1;
    SPI1CON1bits.SPRE = 7;
    SPI1STATbits.SPIROV = 0;
    SPI1STATbits.SPIEN = 1;

    PPSUnLock;
    RPOR1bits.RP3R = 8;
    RPINR20bits.SCK1R = 8;
    RPOR1bits.RP2R = 7;
    RPINR20bits.SDI1R = 7;
    RPOR3bits.RP6R = 9;
    PPSLock;

    TRISBbits.TRISB6 = 0;
    TRISBbits.TRISB3 = 0;
    TRISBbits.TRISB2 = 0;
    TRISBbits.TRISB7 = 1;
}


void UART1Init(void)
{
    PLLFBDbits.PLLDIV = 64; // My Chosen value

	CLKDIVbits.DOZE = 0x5; 
	CLKDIVbits.DOZEN = 1; 
    OSCCONbits.IOLOCK = 0;

	RPINR18bits.U1RXR =5; // RP5 -> Pin14
	RPOR2bits.RP4R = 3; // UART1 TX PR4 -> Pin 11

    OSCCONbits.IOLOCK = 1;

    TRISBbits.TRISB5 = 1;
    TRISBbits.TRISB4 = 0;

  	U1BRG = 191; // (Fp/(16*baudrate)) - 1 
    U1MODE = 0;
    U1MODEbits.UARTEN = 1; // Enable UART
    U1MODEbits.UEN    = 0;
    U1MODEbits.PDSEL  = 0; // 8-bit data, no parity // MUST
    U1MODEbits.STSEL  = 0; // 1 stop bit// MUST
    U1MODEbits.ABAUD  = 0; // No auto baud // CRK
    U1MODEbits.LPBACK = 0; // No loopback mode
    U1STA             = 0;
    U1STAbits.UTXEN   = 1; // Enable transmit
	U1STAbits.URXISEL = 0; // Interrupt after one RX character is received; 
}

void UART2Init(void)
{
    OSCCONbits.IOLOCK = 0;
	RPINR19bits.U2RXR =11; // RP11 -> Pin22
	RPOR5bits.RP10R = 5; // UART2 TX RP10 -> Pin21 
    OSCCONbits.IOLOCK = 1;

    TRISBbits.TRISB11 = 1;
    TRISBbits.TRISB10 = 0;

  	U2BRG =15; //  192/12 - 1; // (Fp/(16*baudrate)) - 1 
    U2MODE = 0;
    U2MODEbits.UARTEN = 1; // Enable UART
    U2MODEbits.UEN    = 0;
    U2MODEbits.PDSEL  = 0; // 8-bit data, no parity // MUST
    U2MODEbits.STSEL  = 0; // 1 stop bit// MUST
    U2MODEbits.ABAUD  = 0; // No auto baud // CRK
    U2MODEbits.LPBACK = 0; // No loopback mode
    U2STA             = 0;
    U2STAbits.UTXEN   = 1; // Enable transmit
	U2STAbits.URXISEL = 0; // Interrupt after one RX character is received; 
}

void UARTTest(void)
{
    printf("CRK-DEBUG Hello 1 World Clock details COSC (%x) NOSC = (%x) \n", OSCCONbits.COSC, OSCCONbits.NOSC); 
        DelayInSeconds(2);

