curamaj/DSPICAutonomousMobileRobot/robocar.c
}

double GetFloatArg(void)
{
	double parm;
	char ch;
	char buf[12];
	int i = 0;

	/* Print on the UART2 Need more work to simulate interrupt driven */
	for(i=0; i < 12; i++) {buf[i]=0; }
	while ((ch=GetInp()) == ' ') 
			; // Skip Spaces
	i = 0;
	buf[i++] = ch; // Collect  number entered
	while (((ch=GetInp()) != ' ') && (ch != '\r'))
		buf[i++] = ch; // Collect number entered

	sscanf(buf, "%lf", &parm);

	return(parm);
}

void printfBT(char *buf )
{
	int i;
	for (i=0; i < strlen(buf); i++) {
    	while (U2STAbits.TRMT  == 0)
			; // Wait till the transmit buffer is empty
		U2Tx(buf[i]);
	}
}

unsigned char GetBTInput(void)
{
	char ch;
	/* Print on the UART2 Need more work to simulate interrupt driven */
	while (1) {
		char *buf = "\n\rEnter Command:  ";

		ch = U2Rx();
		U2Tx(ch); // Echo back what you read
		crk_bzero(btbuf, BTBUF); sprintf(btbuf, "%s", buf);printfBT(btbuf);
		return(toupper(ch)); // All commands are single character ones
	}
}

void ParseCmd(int cmd)
{
	parse_function[cmd].func();
}

void Parser(void)
{
	unsigned char cmd; 
	exit_parser = 0;
	while (1) {
		Help();
		cmd = GetBTInput();
		ParseCmd(cmd);
		U2Tx('\n');
		U2Tx('\r');
		if(exit_parser == 1) {
			return;
		}
	}
}

void NotImplemented(void)
{
	printfBT("Not Implemented\n");
}

void Ignition(void)
{
}
void ExitParser(void)
{
	exit_parser = 1;
	crk_bzero(btbuf, BTBUF); sprintf(btbuf, "%s","\n\r"); printfBT(btbuf);
}
void SystemHalt(void)
{
	crk_bzero(btbuf, BTBUF); sprintf(btbuf, "%s","\n\r"); printfBT(btbuf);
	exit(0);
}
void Help(void)
{
	int i;
	for(i=0; i < CMDS; i++) {
		if ( parse_function[i].func != NotImplemented) {
			crk_bzero(btbuf, BTBUF); sprintf(btbuf, "%s", parse_function[i].help); printfBT(btbuf);
		}
	}
}

void Trace(void)
{
	boolean status;
	log_data = 1;
	nmea_rec gps_record;
	crk_bzero(gps_record.raw,MAXLINELENGTH);
	
	char buf[MAXLINELENGTH];

	crk_bzero(buf, MAXLINELENGTH);
	status = GetGPSLine(buf);
	if (status == false) {
		printfBT("CRK-DEBUG Could not track satellite or get GPRMC or GGPA records. Try later\n");
		return;
	}
	printfBT(buf);
	status = false;
	status = GetGPRMCorGPGGA(buf, &gps_record);
	if (status == false) {
		printfBT("Could not find GPRMC or GGPA records. Try later\n");
	} else {
		printfBT("Successfully found GPS record of interest\n");
		printfBT(gps_record.raw);
	}
	return;
}

void GPSFix(void)
{
	boolean status;
	log_data = 1;
	int i;
	int max_tries = 4; // Pick some number :(
	
	char buf[MAXLINELENGTH];

	for (i =0; i < max_tries; i++) { 
		crk_bzero(buf, MAXLINELENGTH);
		status = GetGPSLine(buf);
		if (status == false) {
			printfBT("CRK-DEBUG Could not track satellite or get GPRMC or GGPA records. Try later\n");
			return;
		}
		printfBT(buf);
		status = false;
		crk_bzero(rc_src.raw,MAXLINELENGTH);
		status = GetGPRMCorGPGGA(buf, &rc_src);
		if (status == true) {
			if(rc_src.fix == true || rc_src.fixquality != 0) { 
				//=> We found record with a fix ='A' for GPRMC, qual = 1 for GPGGA
				printfBT("Successfully found GPS record of with fix.\n");
				printfBT(rc_src.raw);
				return;
			}
		}
	}

	printfBT("Could not find GPS record with a fix. Please try later \n");
	return;
}


unsigned char GetInp(void)
{
	unsigned char ch;
	ch = U2Rx();
	U2Tx(ch); // Echo back what you read
	return(ch);
}

void GetDestination(void)
{
	double latitude;
	double longitude;
	char ch;
	char lat, lon;
	char buf1[12];
	char buf2[12];
	char buf[128];
	int i = 0;

	/* Print on the UART2 Need more work to simulate interrupt driven */
	for(i=0; i < 12; i++) {buf1[i]=0; buf2[i] = 0;}
	while ((ch=GetInp()) == ' ') 
		;
	i = 0;
	buf1[i++] = ch;
	while ((ch=GetInp()) != ' ') {
		buf1[i++] = ch; // Collect longitude number entered
	}
	while ((ch=GetInp()) == ' ') {
		;
	}
	lat = toupper(ch);	
	while ((ch=GetInp()) == ' ') 
		; 
	i = 0;
	buf2[i++] = ch;
	while (((ch=GetInp()) != ' ') && (ch != '\r'))
		buf2[i++] = ch; // Collect latitude number entered
	while ((ch=GetInp()) == ' ') 
			; // Skip Spaces

	lon = toupper(ch);	
	sscanf(buf1, "%lf", &latitude);
	sscanf(buf2, "%lf", &longitude);

	rc_dst.latitude2 =  latitude;
	rc_dst.lat =  lat;
	rc_dst.longitude2 =  longitude;
	rc_dst.lon =  lon;

	if(lat == 'S')
		rc_dst.latitude2 =  (-1.0) * latitude;

	if(lon == 'W')
		rc_dst.longitude2 =  (-1.0) * longitude;


printf("\n\rCRK-DEBUG rbuf2 = (%s) longitude = (%f) \n\r", buf2, longitude);
printf("CRK-DEBUG buf1 = (%s) latitude = (%f)\n\r", buf1, latitude);

printf("CRK-DEBUG rc_dst.longitude = (%f) (%c) \n\r", rc_dst.longitude2, lon);
printf("CRK-DEBUG rc_dst.latitude = (%f) (%c)\n\r", rc_dst.latitude2, lat);
	
    rc_dist2target =  distance2(rc_src.latitude2, rc_src.longitude2,
            rc_dst.latitude2, rc_dst.longitude2,'M'); //  distance meters.

	crk_bzero(buf, 128); sprintf(buf, "\n\rSource: Latitude = (%lf) (%lf) ", rc_src.latitude2, rc_src.longitude2);printfBT(buf);
	crk_bzero(buf, 128); sprintf(buf, "\n\rDestination: Latitude = (%lf) (%lf) ", rc_dst.latitude2, rc_dst.longitude2);printfBT(buf);
    printf("Distance2 = (%lf)\n", rc_dist2target);

    rc_dist2target =  distance(rc_src.latitude2, rc_src.longitude2,
            rc_dst.latitude2, rc_dst.longitude2,'M'); //  distance meters.
	crk_bzero(buf, 128); sprintf(buf, "\n\rDstance to travel = (%lf meters)",rc_dist2target);printfBT(buf);
    printf("CRK-DEBUG Distance = (%lf)\n", rc_dist2target);

    if (rc_dist2target <= rc_proximity_distance) {
            printf("CRK-DEBUG Reached Destination with in (%lf)\n",rc_proximity_distance);
			crk_bzero(buf, 128); 
			sprintf(buf, "\n\rReached Destination with in (%lf)\n",
						rc_proximity_distance);
			printfBT(buf);
    }

}

void ParserInit(void)
{
	int i;
	for(i=0; i < CMDS; i++) {
		parse_function[i].func = NotImplemented;
	}

	parse_function['I'].func = Ignition; 
			strcpy(parse_function['I'].help,"	I: Turn on Ignition to run the Car\n\r");
	parse_function['F'].func = MoveFwd;
			strcpy(parse_function['F'].help,"	F <n> : Move Forward the Car by 'n' meters\n\r");
	parse_function['B'].func = MoveBack;
			strcpy(parse_function['B'].help,"	B <n> : Move Back the Car by 'n' meters\n\r");
	parse_function['S'].func = Stop;
			strcpy(parse_function['S'].help,"	S : Stop the Car\n\r");

