curamaj/DSPICAutonomousMobileRobot/robocar.c
	parse_function['L'].func = TurnLeft;
			strcpy(parse_function['L'].help,"	L <n> : Turn the Car towards left by <n> degress ( 0 - 90)\n\r");
	parse_function['R'].func = TurnRight;
			strcpy(parse_function['R'].help,"	R <n> : Turn the Car towards right by <n> degress ( 0 - 90)\n\r");
	parse_function['M'].func = Middle;
			strcpy(parse_function['M'].help,"	M <n> : Turn the Car to Middle\n\r");

	parse_function['H'].func = Help;
			strcpy(parse_function['H'].help,"	H  : Help \n\r");
	parse_function['?'].func = Help;
			strcpy(parse_function['?'].help,"	?  : Help \n\r");
	parse_function['T'].func = Trace;
			strcpy(parse_function['T'].help,"	T  : Start tracing the car\n\r");
	parse_function['X'].func = Trace;
			strcpy(parse_function['X'].help,"	X  : Stop logging\n\r");

	parse_function['G'].func = GPSFix;
			strcpy(parse_function['G'].help,"	G  : Get GPS co-ordinates of Car\n\r");
	parse_function['D'].func = GetDestination;
			strcpy(parse_function['D'].help,"	D  : <longitude> <latitude>: Destination co-ordinates <latitude> <longitude>\n\r");
	parse_function['E'].func = ExitParser;
			strcpy(parse_function['E'].help,"	E  : Exit and continue\n\r");
	parse_function['Z'].func = SystemHalt;
			strcpy(parse_function['Z'].help,"	Z  : Halt the Car and reset system\n\r");
	
}

boolean GetGPSLine(char *buffer)
{
	int i = 0;
	int j = 0;
	char buf[MAXLINELENGTH*2];

    printfBT("\n\rTesting GPS ... if this you do not see any output in 60 secomds ... Reset the system\r\n");
	U1STAbits.URXISEL = 0;
	U1STAbits.FERR == 0;
	U1STAbits.OERR = 0;
	j = 0;
	while (1) {
	/* Check for receive errors */
	if(U1STAbits.FERR == 1) {
    	printf("CRK-DEBUG Testing GPS Error !!! i = (%d) \n", i++);
		U1STAbits.FERR = 0;
		continue;
	}
	/* Must clear the overrun error to keep UART receiving */
	if(U1STAbits.OERR == 1) {
		U1STAbits.OERR = 0;
    	printf("CRK-DEBUG Testing GPS Error Overrun !!! i = (%d) \n", i++);
		continue;
	}
	/* Get the data */
	if(U1STAbits.URXDA == 1) {
		buf[i++]  = U1RXREG;
		if(i == MAXLINELENGTH) {
			buf[MAXLINELENGTH-1] = 0;
			strcpy(buffer, buf);
//			printf("CRK-DEBUG Buffer = (%s) strlen buf = (%d) \n", buf, strlen(buf));
			return true;
		}
	}
	}
	printf("CRK-DEBUG test out j = (%d)\n",j);
	return(false);
}

// This is our GPS library

double deg2rad(double deg) {
	return (deg * pi / 180);
}

double rad2deg(double rad) {
	return (rad * 180 / pi);
}


//Note : I see the definition as in distance() on the ionternel, this
//       formula for some reason is not at all accurate for small distances
//       I used proper formula and defined distance2() as a new function
//       I will keep both and experiment with time.
double distance2(double lat1, double lon1, double lat2, double lon2, char unit) {

	double d1, d2, pi1, pi2, la1, la2, dist;
	pi1 = deg2rad(lat1);
	pi2 = deg2rad(lat2);
	la1 = deg2rad(lon1);
	la2 = deg2rad(lon2);

	d1 = sin((pi2-pi1)/2)*sin((pi2-pi1)/2) + cos(pi1)*cos(pi2)*sin((la2-la1)/2) * sin((la2-la1)/2);

	d2 =sqrt(d1);

	dist = 2 * 6371000.0 * asin(d2);
  	return (dist);
}


double distance(double lat1, double lon1, double lat2, double lon2, char unit) {
  	double theta, dist;
  	theta = lon1 - lon2;
  	dist = sin(deg2rad(lat1)) * sin(deg2rad(lat2)) + cos(deg2rad(lat1)) * cos(deg2rad(lat2)) * cos(deg2rad(theta));
  	dist = acos(dist);
  	dist = rad2deg(dist);
  	dist = dist * 60 * 1.1515;
  	switch(unit) {
    	case 'M':
     	 	dist = dist * 1.609344 * 1000;
     	 	break;
    	case 'K':
      		dist = dist * 1.609344;
      		break;
    	case 'N':
      		dist = dist * 0.8684;
     	 	break;
  	}
  	return (dist);
}

// I probably will not need the one below. If needed I will have to
//  print this to BlueTooth device using printfBT() function
//
void gps_print_NMEA_line(nmea_rec *record)
{
	char *ptr = record->raw;
	printf("RAW = (%s)\n", ptr);
    printf("\nTime: ");
    printf("%d", record->hour); printf(":");
    printf("%d", record->minute); printf(":");
    printf("%d",record->seconds); printf(".");
    printf("%d\n",record->milliseconds);
    printf("Date: ");
    printf("%d",record->day); printf("/");
    printf("%d",record->month);printf("/20");
    printf("%d\n", record->year);
    printf("Fix: "); printf("%d",(int)record->fix);
    printf(" quality: "); printf("%d\n", (int)record->fixquality); 
    if (record->fix) {
      printf("Location:\n");
      printf("  Latitude2 (%lf):  Degrees:%f Minutes = %f",record->latitude2, record->latitudeDegrees2, record->latitudeMinutes2); printf("%c\n",record->lat);
      printf("  Longitude2 (%lf):  Degrees:%f Minutes = %f",record->longitude2, record->longitudeDegrees2, record->longitudeMinutes2); printf("%c\n",record->lat);
      
      printf("Speed (knots): "); printf("%f\n", record->speed);
      printf("Angle: "); printf("%f\n",record->angle);
      printf("Altitude: "); printf("%f\n",record->altitude);
      printf("Satellites: "); printf("%d\n", record->satellites);
    }
}

void GetLatitude(char *p, double *latitude, double* degrees, double *minutes)
{  
	char *p1, *p2;
	char buf[12];
	char buf2[12];
	int i;
	int ft2;
    p1 = p;
    char  c2;
    p2 = strchr(p, ',');
    int n = p2-p1;
    for(i=0; i < n; i++) {
		buf[i] = p[i];
    }
	
    buf[i] = 0;
	
// First work on latitude
    buf2[0] = buf[0];
    buf2[1] = buf[1];
    buf2[2] = '.';
    buf2[3] = buf[2];
    buf2[4] = buf[3];
    buf2[5] = buf[5];
    buf2[6] = buf[6];
    buf2[7] = buf[7];
    buf2[8] = buf[8];
    buf2[9] = 0;
	
	c2 = buf[2];
	buf[2] = 0;
	sscanf(buf, "%d", &ft2);
	*degrees = (double)ft2;
	buf[0] = '0'; buf[1] = '0'; buf[2] = c2;
	sscanf(buf+2, "%lf", minutes);

}
void GetLongitude(char *p, double *longitude, double* degrees, double *minutes)
{  
	char *p1, *p2;
	char buf[12];
	char buf2[12];
	int i;
	int ft2;
    p1 = p;
    char c3;
    p2 = strchr(p, ',');
    int n = p2-p1;
    for(i=0; i < n; i++)
	buf[i] = p[i];
    buf[i] = 0;

// First work on longitude
    buf2[0] = buf[0];
    buf2[1] = buf[1];
    buf2[2] = buf[2];
    buf2[3] = '.';
    buf2[4] = buf[3];
    buf2[5] = buf[4];
    buf2[6] = buf[6];
    buf2[7] = buf[7];
    buf2[8] = buf[8];
    buf2[9] = buf[9];
    buf2[10] = 0;
	
sscanf(buf2, "%lf", longitude); 

	c3 = buf[3];
	buf[3] = 0;
	sscanf(buf, "%d", &ft2);
	*degrees = (double)ft2;
	buf[0] = '0'; buf[1] = '0'; buf[2] = 0; buf[3]= c3;
	sscanf(buf+3, "%lf", minutes);

