curamaj/DSPICAutonomousMobileRobot/robocar.c
}

boolean parse_NMEA(nmea_rec *rec) {
  // do checksum check
    uint8_t i;
  uint8_t hour, minute, seconds, year, month, day;
  uint16_t milliseconds = 0;
  double latitude, longitude;
  double latitude2, longitude2;
  int32_t latitude_fixed, longitude_fixed;
  double latitudeDegrees, longitudeDegrees;
  double latitudeDegrees1, longitudeDegrees1;
  double latitudeMinutes, longitudeMinutes;
  double latitudeDegrees2, longitudeDegrees2;
  double latitudeMinutes2, longitudeMinutes2;
  double altitude = 0.0;
  double  geoidheight = 0.0;
  double speed, angle, magvariation, HDOP;
  char lat, lon, mag;
  boolean fix;
  uint8_t fixquality, satellites;
  char gpa[8];

  hour= minute =  seconds =  year =  month =  day = 0;
  latitude_fixed =  longitude_fixed = 0;
  latitude =  longitude = 0.0;
  latitude2 =  longitude2 = 0.0;
  latitudeDegrees =  longitudeDegrees = 0.0;
  latitudeDegrees1 =  longitudeDegrees1 = 0.0;
  latitudeMinutes =  longitudeMinutes = 0.0;
  latitudeDegrees2 =  longitudeDegrees2 = 0.0;
  latitudeMinutes2 =  longitudeMinutes2 = 0.0;
  altitude = 0.0;
  geoidheight = 0.0;
  speed =  angle =  magvariation =  HDOP = 0.0;
  fix = 0;
  fixquality =  satellites = 0;
  lat =  lon =  mag = 0;

  char *nmea = rec->raw;

  strncpy(gpa, nmea, 6);
  gpa[6] = 0; gpa[7] = 0;
  if((strncmp(gpa, "$GPRMC",6) != 0) && (strncmp(gpa, "$GPGGA",6) != 0)) {
	// In this case we are not interested at all
	printf("Found uin-interesting (%s)\n", gpa);
	rec->valid = false;
	return false;
  }

  // first look if we even have one
  if (nmea[strlen(nmea)-4] == '*') {
    uint16_t sum = parseHex(nmea[strlen(nmea)-3]) * 16;
    sum += parseHex(nmea[strlen(nmea)-2]);
    
    // check checksum 
    for (i=2; i < (strlen(nmea)-4); i++) {
      sum ^= nmea[i];
    }
    if (sum != 0) {
      // bad checksum :(
	  printf("CRK-DEBUG Bad checksum for (%s)\n", gpa);
	  rec->valid = false;
      return false;
    }
  }
  int32_t degree;
  long minutes;
  char degreebuff[10];
  // look for a few common sentences
  if (strstr(nmea, "$GPGGA")) {
printf("CRK-DEBUG Found GPGGA\n");
    // found GGA
    char *p = nmea;
    // get time
    p = strchr(p, ',')+1;
    double timef = atof(p);
    uint32_t time = timef;
    hour = time / 10000;
    minute = (time % 10000) / 100;
    seconds = (time % 100);

    milliseconds = (uint16_t)fmod(timef, 1.0) * 1000;

    // parse out latitude
    p = strchr(p, ',')+1;
	GetLatitude(p, &latitude2, &latitudeDegrees2, &latitudeMinutes2);
    if (',' != *p)
    {
      strncpy(degreebuff, p, 2);
      p += 2;
      degreebuff[2] = '\0';
      degree = atol(degreebuff) * 10000000;
      strncpy(degreebuff, p, 2); // minutes
      p += 3; // skip decimal point
      strncpy(degreebuff + 2, p, 4);
      degreebuff[6] = '\0';
//printf("CRK-DEBUG degree buf = (%s)\n", degreebuff);
      minutes = 50 * atol(degreebuff) / 3;
      latitude_fixed = degree + minutes;
      latitude = degree / 100000 + minutes * 0.000006F;
      latitudeDegrees =  (int)(latitude-100*(int)(latitude/100))/60.0;
      latitudeDegrees += (int)(latitude/100);
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      if (p[0] == 'S') latitudeDegrees *= -1.0;
      if (p[0] == 'N') lat = 'N';
      else if (p[0] == 'S') lat = 'S';
      else if (p[0] == ',') lat = 0;
      else {
		rec->valid = false;
		return false;
	  }
    }
    
    // parse out longitude
    p = strchr(p, ',')+1;
	GetLongitude(p, &longitude2, &longitudeDegrees2, &longitudeMinutes2);
    if (',' != *p)
    {
      strncpy(degreebuff, p, 3);
      p += 3;
      degreebuff[3] = '\0';
      degree = atol(degreebuff) * 10000000;
      strncpy(degreebuff, p, 2); // minutes
      p += 3; // skip decimal point
      strncpy(degreebuff + 2, p, 4);
      degreebuff[6] = '\0';
      minutes = 50 * atol(degreebuff) / 3;
      longitude_fixed = degree + minutes;
      longitude = degree / 100000 + minutes * 0.000006F;
      longitudeDegrees = (int)(longitude-100*(int)(longitude/100))/60.0;
      longitudeDegrees += (int)(longitude/100);

		longitudeMinutes = modf(longitude, &longitudeDegrees1);
		longitudeDegrees1 = longitudeDegrees1/100;
		longitudeMinutes = 100*longitudeMinutes;
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
//CRK      if (p[0] == 'W') longitudeDegrees *= -1.0;
      if (p[0] == 'W') lon = 'W';
      else if (p[0] == 'E') lon = 'E';
      else if (p[0] == ',') lon = 0;
      else {
		rec->valid = false;
		return false;
	  }
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      fixquality = atoi(p);
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      satellites = atoi(p);
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      HDOP = atof(p);
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      altitude = atof(p);
    }
    
    p = strchr(p, ',')+1;
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      geoidheight = atof(p);
    }
  rec->hour =  hour; 
  rec->minute =  minute; 
  rec->seconds =  seconds; 
  rec->year =  year; 
  rec->month = month; 
  rec->day = day;
  rec->milliseconds = milliseconds;
  rec->latitude =  latitude;
  rec->longitude =  longitude;

  if (lat == 'S')
  	rec->latitude2 =  latitude2 * -1.0;
  else
  	rec->latitude2 =  latitude2;

  if (lon == 'W')
  	rec->longitude2 =  longitude2 * -1.0;
  else
  	rec->longitude2 =  longitude2;

  rec->latitude_fixed =  latitude_fixed;
  rec->longitude_fixed = longitude_fixed;

  rec->latitudeDegrees =  latitudeDegrees;
  rec->longitudeDegrees =  longitudeDegrees;

  rec->latitudeDegrees1 =  latitudeDegrees1;
  rec->latitudeMinutes =  latitudeMinutes;
  rec->longitudeDegrees1 =  longitudeDegrees1;
  rec->longitudeMinutes =  longitudeMinutes;
  rec->latitudeDegrees2 =  latitudeDegrees2;
  rec->latitudeMinutes2 =  latitudeMinutes2;
// printf("  Latitudexx:  Degrees:%d Minutes = %f",rec->latitudeDegrees2, rec->latitudeMinutes2); 
  rec->longitudeDegrees2 =  longitudeDegrees2;
  rec->longitudeMinutes2 =  longitudeMinutes2;

  rec->geoidheight =  geoidheight;
  rec->altitude =  altitude;
  rec->speed =  speed;
  rec->angle =  angle;
  rec->magvariation =  magvariation;
  rec->HDOP =  HDOP;
  rec->lat =  lat;
  rec->lon =  lon;
  rec->mag = mag;
  rec->fix =  fix;
  rec->fixquality =  fixquality;
  rec->satellites =  satellites;
  rec->valid = true;
    return true;
	 
