curamaj/DSPICAutonomousMobileRobot/robocar.c
  }
  if (strstr(nmea, "$GPRMC")) {
   // found RMC
    char *p = nmea;
    // get time
    p = strchr(p, ',')+1;
    double timef = atof(p);
    uint32_t time = timef;
    hour = time / 10000;
    minute = (time % 10000) / 100;
    seconds = (time % 100);
printf("CRK-DEBUG Found GPRMC !!!\n");

    milliseconds = fmod(timef, 1.0) * 1000;

    p = strchr(p, ',')+1;
    // Serial.println(p);
    if (p[0] == 'A') 
      fix = true;
    else if (p[0] == 'V')
      fix = false;
    else {
	  rec->valid = false;
      return false;
    }

    // parse out latitude
    p = strchr(p, ',')+1;
	GetLatitude(p, &latitude2, &latitudeDegrees2, &latitudeMinutes2);
    if (',' != *p)
    {
      strncpy(degreebuff, p, 2);
      p += 2;
      degreebuff[2] = '\0';
      long degree = atol(degreebuff) * 10000000;
      strncpy(degreebuff, p, 2); // minutes
      p += 3; // skip decimal point
      strncpy(degreebuff + 2, p, 4);
      degreebuff[6] = '\0';
      long minutes = 50 * atol(degreebuff) / 3;
      latitude_fixed = degree + minutes;
      latitude = degree / 100000 + minutes * 0.000006F;
      latitudeDegrees = (latitude-100*(int)(latitude/100))/60.0;
      latitudeDegrees += (int)(latitude/100);


	latitudeMinutes = modf(latitude, &latitudeDegrees1);
	latitudeDegrees1 = latitudeDegrees1/100;
	latitudeMinutes = 100*latitudeMinutes;


    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
//      if (p[0] == 'S') latitudeDegrees *= -1.0;
      if (p[0] == 'N') lat = 'N';
      else if (p[0] == 'S') lat = 'S';
      else if (p[0] == ',') lat = 0;
      else {
		rec->valid = false;
		return false;
	  }
    }
    
    // parse out longitude
    p = strchr(p, ',')+1;
    GetLongitude(p,&longitude2, &longitudeDegrees2, &longitudeMinutes2); 
    if (',' != *p)
    {
      strncpy(degreebuff, p, 3);
      p += 3;
      degreebuff[3] = '\0';
      degree = atol(degreebuff) * 10000000;
      strncpy(degreebuff, p, 2); // minutes
      p += 3; // skip decimal point
      strncpy(degreebuff + 2, p, 4);
      degreebuff[6] = '\0';
      minutes = 50 * atol(degreebuff) / 3;
      longitude_fixed = degree + minutes;
      longitude = degree / 100000 + minutes * 0.000006F;
      longitudeDegrees = (longitude-100*(int)(longitude/100))/60.0;
      longitudeDegrees += (int)(longitude/100);

		longitudeMinutes = modf(longitude, &longitudeDegrees1);
		longitudeDegrees1 = longitudeDegrees1/100;
		longitudeMinutes = 100*longitudeMinutes;
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
//CRK      if (p[0] == 'W') longitudeDegrees *= -1.0;
      if (p[0] == 'W') lon = 'W';
      else if (p[0] == 'E') lon = 'E';
      else if (p[0] == ',') lon = 0;
      else  {
	    rec->valid = false;
		return false;
	  }
    }
    // speed
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      speed = atof(p);
    }
    
    // angle
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      angle = atof(p);
    }
    
    p = strchr(p, ',')+1;
    if (',' != *p)
    {
      uint32_t fulldate = atof(p);
      day = fulldate / 10000;
      month = (fulldate % 10000) / 100;
      year = (fulldate % 100);
    }
    // we dont parse the remaining, yet!
  rec->hour =  hour; 
  rec->minute =  minute; 
  rec->seconds =  seconds; 
  rec->year =  year; 
  rec->month = month; 
  rec->day = day;
  rec->milliseconds = milliseconds;
  rec->latitude =  latitude;
  rec->longitude =  longitude;
  if (lat == 'S')
  	rec->latitude2 =  latitude2 * -1.0;
  else
  	rec->latitude2 =  latitude2;

  if (lon == 'W')
  	rec->longitude2 =  longitude2 * -1.0;
  else
  	rec->longitude2 =  longitude2;

  rec->latitude_fixed =  latitude_fixed;
  rec->longitude_fixed = longitude_fixed;
  rec->latitudeDegrees =  latitudeDegrees;
  rec->longitudeDegrees =  longitudeDegrees;
  rec->latitudeDegrees1 =  latitudeDegrees1;
  rec->longitudeDegrees1 =  longitudeDegrees1;
  rec->latitudeDegrees2 =  latitudeDegrees2;
  rec->longitudeDegrees2 =  longitudeDegrees2;
  rec->latitudeMinutes =  latitudeMinutes;
  rec->longitudeMinutes =  longitudeMinutes;
  rec->latitudeMinutes2 =  latitudeMinutes2;
  rec->longitudeMinutes2 =  longitudeMinutes2;

  rec->geoidheight =  geoidheight;
  rec->altitude =  altitude;
  rec->speed =  speed;
  rec->angle =  angle;
  rec->magvariation =  magvariation;
  rec->HDOP =  HDOP;
  rec->lat =  lat;
  rec->lon =  lon;
  rec->mag = mag;
  rec->fix =  fix;
  rec->fixquality =  fixquality;
  rec->satellites =  satellites;
  rec->valid = true;
    return true;
  }

  rec->valid = false;
  return false;
}

// read a Hex value and return the decimal equivalent
uint8_t parseHex(char c) 
{
    if (c < '0')
      return 0;
    if (c <= '9')
      return c - '0';
    if (c < 'A')
       return 0;
    if (c <= 'F')
       return (c - 'A')+10;
    // if (c > 'F')
    return 0;
}

boolean GetGPRMCorGPGGA(char *buf,  nmea_rec *rec )
{
	int i = 0;
	int j = 0;
	unsigned char ch;
	char *raw = rec->raw;

	// Read between two $ signs. 
    while ((ch=buf[i++]) != '$')
            ; // Skip Spaces
    raw[j++] = ch;
    while ((ch=buf[i++]) != '$') {
        raw[j++] = ch; // Collect record data
	}
	raw[j++] = 0;
	if((strncmp(raw, "$GPRMC", 6) == 0) || 
				(strncmp(raw, "$GPGGA", 6) == 0)) {
printf("CRK-DEBUG !!! FOund record (%s)\n", raw);
		parse_NMEA(rec);
		if (rec->valid == true) {
			gps_print_NMEA_line(rec);
			return (true);
		}
	}
	return (false);
}

/* Main routine and alogorithm
	Initialize the hardware
		- Initialize DSP ( Heart )
			- Basic initialization
			- Based on Hardware assembled initialize the pinouts
			- We need at least the following ones:
				- Debug and Printf - One UART1
				- GPS interface : One UART2
				- I2C based Magnetometer interface
				- PWM interface for the Servo
				- In addition we may need:
					- SPI based FLASH ?
					- Bluetooth (UART ? ) for Point B access
				
		- Run Some diagnostics to ensure HW is right
			- R/W on SPI
			- UART Loopback test 	
		- Initialize GPS ( To get current co-ordinates of the Car PointA)
		- Initialize Bluetooth ( To get information on where the target is )
		- Initialize magnetometer ( To get the alignment with North pole )
		- Initialize Servo Motor ( To turn and drive to the  target Point B)
		- Note: if needed we can add optical sensor to see the way to adjust.

	Initialize high level routines 
		- Set init values such as : When  the car needs to stop etc
		- Get current location of the car ( From GPS  Point A)
		- Get the location of the target ( from Bluetoth Point B )
		- Get the current of alignment of the car  to Northpole (Magnetometer)
		- Calculate straight line distance between A & B
		- Calculate the angle we need to turn to face the target
		- Start the car to move towards destination
		 
	Main Loop :
		while (1) {
			- Read GPS and Get current location of Car - A
			- Get the location of the target - B
			- if  (B has not changed )  
				continue
			- D = Calculate distance between A and B
			- Send the Data on A and B co-ordinates and distance 
			  to some debug terminal/Webpage.
			- if The distance D is within the limits then
				We have reached destination. Time to stop
			- If needed
				Program Servo to change direction and other parameters
		}

*/
int main(void) 
{
	AD1PCFGL = 0xFFFF; // Make all Analog as Digital pinouts
	
	ParserInit();
	UART1Init();
	UART2Init();
	printfBT("\n\rIf You see this, that means BlueTooth Initialized\n");
    LEDInit();
	SPIInit();
	ServoInit();
	printfBT("\n\rSystem Initialized and Read to go\n");
	printfBT("\n\rBasic testing in progress\n");

	LEDTest();

	BlueToothTest();
// SPITestFlash();
//	SPITestMagnet();
//	ServoTest();
	Parser();
	
	
	fflush(stdout);
    return 0;
}
